ГТС/УТГТС/DataProcessors/РасчетСтеллажейПодЕвроподдоныНовая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РасчетСтеллажейПодЕвроподдоныНовая</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покрытие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоподъемность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/СоответствиеНоменклатурыСЕТ_ГТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыСЕТ_ГТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>НоменклатураГТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураСЕТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыПредставленияНаборовВПечатныхФормах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыПредставленияНаборовВПечатныхФормах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТолькоНабор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборИКомплектующие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоКомплектующие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыРасчетаЦенНаборов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыРасчетаЦенНаборов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РассчитываетсяИзЦенКомплектующих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьСборкиРазборки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаЦеныНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаЦенНаборов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПредставленияНабораВПечатныхФормах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПредставленияНаборовВПечатныхФормах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитТовары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/РасчетСтеллажейПодЕвроподдоныНовая/Forms/СборкаНовойНоменклатуры/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьЭлементыСправочников(Команда)
	СоздатьЭлементыСправочниковНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

/////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "НоменклатураСЕТ, АдресСтрокКомплектующих,Вес");
	//
	Если ЗначениеЗаполнено(НоменклатураСЕТ) тогда//определим текущую комплектацию и соответствие
		СоответствиеГТС = Альтерлого.СоответствиеНоменклатуры(НоменклатураСЕТ);
	Иначе
		НоменклатураСЕТ = Параметры.НаименованиеНоменклатурыСЕТ;
		НадоСоздатьСЕТ = Истина;
	КонецЕсли;
	//
	ПрофильСЕТ = АльтерЛОГО.ПрофильНоменклатуры(строка(НоменклатураСЕТ));
	УстановитьПрофильГТС();
	//
	Если ЗначениеЗаполнено(СоответствиеГТС) тогда
		НоменклатураГТС = СоответствиеГТС;
	Иначе
		НоменклатураГТС = НаименованиеНоменклатурыГТС();
		НадоСоздатьГТС = Истина;
	Конецесли;
	//
	Если ТипЗнч(НоменклатураСЕТ) = Тип("СправочникСсылка.Номенклатура") тогда
		НаборСЕТ = Альтерлого.КомплектацияНоменклатуры(НоменклатураСЕТ);
		Если ЗначениеЗаполнено(НаборСЕТ) тогда
			ТЗ = НаборСЕТ.Товары.Выгрузить(,"Номенклатура, Количество");
			КомплектацияСЕТ.Загрузить(ТЗ);
		Иначе
			ЗаполнитьНаборИзМассива();
		КонецЕсли;
	Иначе
		ЗаполнитьНаборИзМассива();
	Конецесли;
	//
	Если ТипЗнч(НоменклатураСЕТ) = Тип("СправочникСсылка.Номенклатура") тогда
		НаборГТС = Альтерлого.КомплектацияНоменклатуры(НоменклатураГТС);
		Если ЗначениеЗаполнено(НаборГТС) тогда
			ТЗ = НаборГТС.Товары.Выгрузить(,"Номенклатура, Количество");
			КомплектацияГТС.Загрузить(ТЗ);
		Иначе
			ЗаполнитьНаборГТСИзСЕТ();
		КонецЕсли;
	Иначе
		ЗаполнитьНаборГТСИзСЕТ();
	Конецесли;
	//
	УстановитьГруппыНоменклатуры();
КонецПроцедуры

&НаСервере
Функция НаименованиеНоменклатурыГТС()
	
	НаименованиеСЕТ = строка(НоменклатураСЕТ);
	
	Наименование = СтрЗаменить(НаименованиеСЕТ, "СЕТ", "ГТС");
	Наименование = СтрЗаменить(Наименование, ПрофильСЕТ, ПрофильГТС);
	//
	возврат Наименование;
	
КонецФункции

&НаСервере
Процедура УстановитьПрофильГТС()
	Если НЕ ЗначениеЗаполнено(ПрофильСЕТ) тогда возврат конецесли;
	//
	СтруктураПрофиля = АльтерЛОГО.СтруктураПрофиляНоменклатуры(ПрофильСЕТ, строка(НоменклатураСЕТ));
	Если НЕ ТипЗнч(СтруктураПрофиля) = Тип("Структура") тогда возврат конецесли;
	//
	ПрофильГТС = "("+СтруктураПрофиля.ВысотаПрофиля + "." + СтруктураПрофиля.ТолщинаМеталла+")";
КонецПроцедуры

&НаСервере
Процедура УстановитьГруппыНоменклатуры()
	НаименованиеСЕТ = ВРег(строка(НоменклатураСЕТ));
	НаименованиеГТС = ВРег(строка(НоменклатураГТС));
	//
	Если Найти(НаименованиеСЕТ, "БАЛКА") > 0 тогда
		КореньСЕТ = Справочники.Номенклатура.НайтиПоКоду("0-000001483");		
	ИначеЕсли Найти(НаименованиеСЕТ, "РАМА") тогда
		Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НаименованиеСЕТ, " ");
		Если Прав(Массив[1], 2) = "-1" тогда
			КореньСЕТ = Справочники.Номенклатура.НайтиПоКоду("0--00021300");
		ИначеЕсли Прав(Массив[1], 2) = "-2" тогда
			КореньСЕТ = Справочники.Номенклатура.НайтиПоКоду("0-000001558");
		Иначе
			возврат;
		Конецесли;		
	Конецесли;
	//
	Если Найти(НаименованиеГТС, "БАЛКА") > 0 тогда
		КореньГТС = Справочники.Номенклатура.НайтиПоКоду("0--00000246");		
	ИначеЕсли Найти(НаименованиеГТС, "РАМА") тогда
		Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НаименованиеГТС, " ");
		Если Прав(Массив[1], 2) = "-1" тогда
			КореньГТС = Справочники.Номенклатура.НайтиПоКоду("0--00000267");
		ИначеЕсли Прав(Массив[1], 2) = "-2" тогда
			КореньГТС = Справочники.Номенклатура.НайтиПоКоду("0--00000274");
		Иначе
			возврат;
		Конецесли;		
	Конецесли;
	//
	НаименованиеПодгруппыСЕТ = Сред(ПрофильСЕТ, 2, СтрДлина(ПрофильСЕТ)-2);
	НаименованиеПодгруппыГТС = Сред(ПрофильГТС, 2, СтрДлина(ПрофильГТС)-2);
	
	ГруппаНоменклатурыСЕТ = НоменклатураВГруппе(КореньСЕТ, НаименованиеПодгруппыСЕТ);
	ГруппаНоменклатурыГТС = НоменклатураВГруппе(КореньГТС, НаименованиеПодгруппыГТС);
	
	// Перебор строк комплектаций
	Для Каждого СтрокаКомпл из КомплектацияСЕТ цикл
		Если СтрокаКомпл.Статус = "<к созданию>" тогда
			УстановитьГруппуКомплектующего(СтрокаКомпл);
		Иначе
			СтрокаКомпл.Группа = СтрокаКомпл.Номенклатура.Родитель;
		Конецесли;
	Конеццикла;
	//
	Для Каждого СтрокаКомпл из КомплектацияГТС цикл
		Если СтрокаКомпл.Статус = "<к созданию>" тогда
			УстановитьГруппуКомплектующего(СтрокаКомпл);
		Иначе
			СтрокаКомпл.Группа = СтрокаКомпл.Номенклатура.Родитель;
		Конецесли;
	Конеццикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьГруппуКомплектующего(СтрокаКомпл)
	Наименование = ВРег(СтрокаКомпл.Номенклатура);
	Если Найти(Наименование, "СЕТ") > 0 тогда
		Если Найти(Наименование, "РАСКОС") > 0 тогда
			Структура = Альтерлого.СтруктураПрофиляНоменклатуры(ПрофильСЕТ, Наименование);
			Если Структура.ВысотаПрофиля = "70" тогда
				СтрокаКомпл.Группа = Справочники.Номенклатура.НайтиПоКоду("0--00000094");
			ИначеЕсли Структура.ВысотаПрофиля = "85" тогда
				СтрокаКомпл.Группа = Справочники.Номенклатура.НайтиПоКоду("0--00049326");
			ИначеЕсли Структура.ВысотаПрофиля = "100" тогда
				СтрокаКомпл.Группа = Справочники.Номенклатура.НайтиПоКоду("0--00000095");
			ИначеЕсли Структура.ВысотаПрофиля = "130" тогда
				СтрокаКомпл.Группа = Справочники.Номенклатура.НайтиПоКоду("0--00004075");
			КонецЕсли;
		ИначеЕсли Найти(Наименование, "СТОЙКА") > 0 тогда
			Корень = Справочники.Номенклатура.НайтиПоКоду("0-000005500");
			СтрокаКомпл.Группа = НоменклатураВГруппе(Корень, Сред(ПрофильСЕТ, 2, СтрДлина(ПрофильСЕТ)-2));
		КонецЕсли;
	Конецесли;
	//
	Если Найти(Наименование, "ГТС") > 0 тогда
		Если Найти(Наименование, "РАСКОС") > 0 тогда
			Структура = Альтерлого.СтруктураПрофиляНоменклатуры(ПрофильСЕТ, Наименование);
			Если Структура.ВысотаПрофиля = "70" тогда
				СтрокаКомпл.Группа = Справочники.Номенклатура.НайтиПоКоду("0--00000281");  
			ИначеЕсли Структура.ВысотаПрофиля = "100" тогда
				СтрокаКомпл.Группа = Справочники.Номенклатура.НайтиПоКоду("0--00049327");
			ИначеЕсли Структура.ВысотаПрофиля = "100" тогда
				СтрокаКомпл.Группа = Справочники.Номенклатура.НайтиПоКоду("0--00000280");
			ИначеЕсли Структура.ВысотаПрофиля = "130" тогда
				СтрокаКомпл.Группа = Справочники.Номенклатура.НайтиПоКоду("0--00003482");
			КонецЕсли;
		ИначеЕсли Найти(Наименование, "СТОЙКА") > 0 тогда
			Корень = Справочники.Номенклатура.НайтиПоКоду("0--00000286");
			СтрокаКомпл.Группа = НоменклатураВГруппе(Корень, Сред(ПрофильГТС, 2, СтрДлина(ПрофильГТС)-2));
		КонецЕсли;
	Конецесли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаборИзМассива()
	Массив = ПолучитьИзВременногоХранилища(АдресСтрокКомплектующих);
	Для каждого Элемент из Массив цикл
		нСтр = КомплектацияСЕТ.Добавить();
		нСтр.Номенклатура = ?(ЗначениеЗаполнено(Элемент.Номенклатура), Элемент.Номенклатура, Элемент.НаименованиеНоменклатуры);
		нСтр.Количество = Элемент.Количество;
		нСтр.Статус = ?(ЗначениеЗаполнено(Элемент.Номенклатура), "<имеется>", "<к созданию>");
	Конеццикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаборГТСИзСЕТ()
	Для каждого СтрокаТЗ из КомплектацияСЕТ цикл
		нСтр = КомплектацияГТС.Добавить();
		НаименованиеСЕТ = строка(НоменклатураСЕТ);
		Если Найти(ВРег(НаименованиеСЕТ), "РАСКОС") > 0
			ИЛИ Найти(ВРег(НаименованиеСЕТ), "СТОЙКА") > 0 тогда			
			НаименованиеГТС = СтрЗаменить(НаименованиеСЕТ, "СЕТ", "ГТС");
			//
			НоменклатураСтроки = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеГТС);
			Если НоменклатураСтроки.Пустая() тогда
				НоменклатураСтроки = НаименованиеГТС;
			Конецесли;
			нСтр.Номенклатура = НоменклатураСтроки;
		Иначе
			нСтр.Номенклатура = СтрокаТЗ.Номенклатура;
		Конецесли;
		//
		нСтр.Количество = СтрокаТЗ.Количество;
		нСтр.Статус = ?(ТипЗнч(нСтр.Номенклатура) = Тип("СправочникСсылка.Номенклатура"), "<имеется>", "<к созданию>");		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция НоменклатураВГруппе(Группа, Наименование)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.ЭтоГруппа
	                      |	И Номенклатура.Родитель = &Родитель
	                      |	И Номенклатура.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Родитель", Группа);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	возврат Выборка.Ссылка;
	
КонецФункции

&НаСервере
Функция ЭлементыГруппыНоменклатуры(Группа)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Номенклатура.Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Родитель = &Группа");
	Запрос.УстановитьПараметр("Группа", Группа);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	возврат Выборка.Ссылка;
КонецФункции

&НаСервере
Процедура СоздатьЭлементыСправочниковНаСервере()
	МассивДляРасчетаВеса = Новый Массив;
	// Номенклатура СЕТ
	СозданаНовая=Ложь;
	Если (ТипЗнч(НоменклатураСЕТ) = Тип("Строка") 
		И НЕ ПустаяСтрока(НоменклатураСЕТ)
		И ЗначениеЗаполнено(ГруппаНоменклатурыСЕТ)) ИЛИ 
		(лев(НоменклатураСЕТ,4)="Рама" И НЕ ЗначениеЗаполнено(Справочники.Номенклатура.НайтиПоНаименованию(строка(НоменклатураСЕТ) + " (набор)",истина)) 
		И НЕ ПустаяСтрока(НоменклатураСЕТ)
		И ЗначениеЗаполнено(ГруппаНоменклатурыСЕТ)) тогда
		//
		ЭлементДляКопии = ЭлементыГруппыНоменклатуры(ГруппаНоменклатурыСЕТ);
		Если НЕ ЗначениеЗаполнено(ЭлементДляКопии) тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Группа номенклатуры СЕТ не содержит номенклатуры для копирования. Номенклатура СЕТ сформирована не будет.");
		Иначе
			Нов = ЭлементДляКопии.Скопировать();
			если лев(НоменклатураСЕТ,4)="Рама" Тогда
			Нов.Наименование = строка(НоменклатураСЕТ) + " (Набор)";
			Нов.НаименованиеПолное = НоменклатураСЕТ;
			Нов.ТипНоменклатуры=Перечисления.ТипыНоменклатуры.Набор;
			Нов.ВесЧислитель = Вес;
			Нов.ВесЗнаменатель = 1;
			Нов.ВесИспользовать = Истина;
			Нов.СхемаОбеспечения=Справочники.СхемыОбеспечения.НайтиПоНаименованию("Промсвязь, паллетка");
			Нов.ДополнительныеРеквизиты.Очистить();	
			Иначе
			Нов.Наименование = НоменклатураСЕТ;
			Нов.НаименованиеПолное = НоменклатураСЕТ;
			Нов.ВесЧислитель = Вес;
			Нов.ВесЗнаменатель = 1;
			Нов.ВесИспользовать = Истина;
			Нов.СхемаОбеспечения=Справочники.СхемыОбеспечения.НайтиПоНаименованию("Промсвязь, паллетка");
			Нов.ДополнительныеРеквизиты.Очистить();
			КонецЕсли;
			Нов.Записать();
			СозданаНовая=Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создали элемент номенклатуры: "+Нов.Наименование);
			//
			НоменклатураСЕТ = Нов.Ссылка;
			НадоСоздатьСЕТ = Ложь;
			МассивДляРасчетаВеса.Добавить(НоменклатураСЕТ);
		Конецесли;
	Конецесли;	
	// 
	// Номенклатура ГТС
	Если ТипЗнч(НоменклатураГТС) = Тип("Строка") 
		И НЕ ПустаяСтрока(НоменклатураГТС)
		И ЗначениеЗаполнено(ГруппаНоменклатурыГТС) тогда
		//
		ЭлементДляКопии = ЭлементыГруппыНоменклатуры(ГруппаНоменклатурыГТС);
		Если НЕ ЗначениеЗаполнено(ЭлементДляКопии) тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Группа номенклатуры ГТС не содержит номенклатуры для копирования. Номенклатура ГТС сформирована не будет.");
		Иначе
			Нов = ЭлементДляКопии.Скопировать();
			Нов.Наименование = НоменклатураГТС;
			Нов.НаименованиеПолное = НоменклатураГТС;
			Нов.ВесЧислитель = Вес;
			Нов.ВесЗнаменатель = 1;
			Нов.ВесИспользовать = Истина;
			Нов.СхемаОбеспечения=Справочники.СхемыОбеспечения.НайтиПоНаименованию("Промсвязь, паллетка");
			Нов.ДополнительныеРеквизиты.Очистить();
			попытка
			Нов.Записать();
			исключение
			конецпопытки;
			//
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создали элемент номенклатуры: "+Нов.Наименование);
			//
			НоменклатураГТС = Нов.Ссылка;
			НадоСоздатьГТС = Ложь;
		Конецесли;
	Конецесли;	
	// 
	// Комплектация СЕТ
	Если (Не ЗначениеЗаполнено(НаборСЕТ)
		И ЗначениеЗаполнено(НоменклатураСЕТ)) ИЛИ 
		(лев(НоменклатураСЕТ,4)="Рама" и СозданаНовая=Истина)
		тогда
		Нов = Справочники.ВариантыКомплектацииНоменклатуры.СоздатьЭлемент();
			
			если лев(НоменклатураСЕТ,4)="Рама" Тогда
			Нов.Владелец = НоменклатураСЕТ;
			Нов.Наименование = "Основная комплектация";
			Нов.ВариантПредставленияНабораВПечатныхФормах=Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоКомплектующие;
			Нов.ВариантРасчетаЦеныНабора=Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих;
			Нов.Основной = Истина;
	
			Иначе
			Нов.Владелец = НоменклатураСЕТ;
			Нов.Наименование = "Основная комплектация";
			Нов.Основной = Истина;

			КонецЕсли;

		
		//
		Для каждого СтрТЗ из КомплектацияСЕТ цикл
			Если СтрТЗ.Статус = "<к созданию>"
				И ЗначениеЗаполнено(СтрТЗ.Группа) тогда
				ЭлементДляКопии = ЭлементыГруппыНоменклатуры(СтрТЗ.Группа);
				НовКомпл = ЭлементДляКопии.Скопировать();
				НовКомпл.Наименование = СтрТЗ.Номенклатура;
				НовКомпл.НаименованиеПолное = СтрТЗ.Номенклатура;
				НовКомпл.ВесЧислитель = 0;
				НовКомпл.ВесЗнаменатель = 1;
				//НовКомпл.Количество=1;
				//НовКомпл.КоличествоУпаковок=1;
				//НовКомпл.СхемаОбеспечения=Справочники.СхемыОбеспечения.НайтиПоНаименованию("Промсвязь, паллетка");
				НовКомпл.Записать();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создали элемент номенклатуры: "+НовКомпл.Наименование);
				//
				Комплектующая = НовКомпл.Ссылка;
				МассивДляРасчетаВеса.Добавить(Комплектующая);
				СтрТЗ.Номенклатура = Комплектующая;
				СтрТЗ.Статус = "<имеется>";
			Иначе
				Комплектующая = СтрТЗ.Номенклатура;
			Конецесли;
			НовСтр = Нов.Товары.Добавить();
			НовСтр.Номенклатура = Комплектующая;
			НовСтр.Количество = СтрТЗ.Количество;
			НовСтр.КоличествоУпаковок = НовСтр.Количество;
			//ищем шайбу
			Если комплектующая=Справочники.Номенклатура.НайтиПоКоду("0--00000037") Тогда
				Нов.НоменклатураОсновногоКомпонента=комплектующая;
			КонецЕсли;
		Конеццикла;
		Нов.Записать();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создали комплектацию номенклатуры: "+НоменклатураСЕТ.Наименование);
	Конецесли;
	// Комплектация ГТС
	Если Не ЗначениеЗаполнено(НаборГТС)
		И ЗначениеЗаполнено(НоменклатураГТС) тогда
		Нов = Справочники.ВариантыКомплектацииНоменклатуры.СоздатьЭлемент();
		Нов.Владелец = НоменклатураГТС;
		Нов.Наименование = "Основная комплектация";
		Нов.Основной = Истина;
		//
		Для каждого СтрТЗ из КомплектацияГТС цикл
			Если СтрТЗ.Статус = "<к созданию>"
				И ЗначениеЗаполнено(СтрТЗ.Группа) тогда
				ЭлементДляКопии = ЭлементыГруппыНоменклатуры(СтрТЗ.Группа);
				НовКомпл = ЭлементДляКопии.Скопировать();
				НовКомпл.Наименование = СтрТЗ.Номенклатура;
				НовКомпл.НаименованиеПолное = СтрТЗ.Номенклатура;
				НовКомпл.ВесЧислитель = Вес;
				НовКомпл.ВесИспользовать = Истина;
				НовКомпл.ВесЗнаменатель = 1;
				//НовКомпл.Количество=1;
				//НовКомпл.КоличествоУпаковок=1;
				//НовКомпл.СхемаОбеспечения=Справочники.СхемыОбеспечения.НайтиПоНаименованию("Промсвязь, паллетка");
				попытка
				НовКомпл.Записать();
				исключение
			//	сообщить("не удалось записать " + НовКомпл.НаименованиеПолное + " для позиции " +Нов.Владелец);  
				конецпопытки;
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создали элемент номенклатуры: "+НовКомпл.Наименование);
				//
				Комплектующая = НовКомпл.Ссылка;
				МассивДляРасчетаВеса.Добавить(Комплектующая);
				СтрТЗ.Номенклатура = Комплектующая;
				СтрТЗ.Статус = "<имеется>";
			Иначе
				Комплектующая = СтрТЗ.Номенклатура;
			Конецесли;
			НовСтр = Нов.Товары.Добавить();
			НовСтр.Номенклатура = Комплектующая;
			НовСтр.Количество = СтрТЗ.Количество;
			НовСтр.КоличествоУпаковок = НовСтр.Количество;
		Конеццикла;
		попытка
		Нов.Записать();
		исключение 
		конецпопытки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создали комплектацию номенклатуры: "+НоменклатураГТС.Наименование);
	Конецесли;
	//
	СоответствиеГТС = Альтерлого.СоответствиеНоменклатуры(НоменклатураСЕТ);
	Если НЕ ЗначениеЗаполнено(СоответствиеГТС) 
		И ЗначениеЗаполнено(НоменклатураСЕТ)
		И ЗначениеЗаполнено(НоменклатураГТС) тогда
		Рег = РегистрыСведений.СоответствиеНоменклатурыСЕТ_ГТС.СоздатьМенеджерЗаписи();
		Рег.НоменклатураГТС = НоменклатураГТС;
		Рег.НоменклатураСЕТ = НоменклатураСЕТ;
		Рег.Записать();
	КонецЕсли;	
КонецПроцедуры
